app/controllers/roles_controller.rb

SELECT `roles`.* FROM `roles`
---
  def index
    @roles = Role.all

INSERT INTO `roles` (`created_at`, `name`, `updated_at`) VALUES ('2014-02-12 08:49:47', 'admin', '2014-02-12 08:49:47')
---
  def create
    @role = Role.new(role_params)
    respond_to do |format|
      if @role.save

UPDATE `roles` SET `name` = 'user', `updated_at` = '2014-02-12 08:51:06' WHERE `roles`.`id` = 2
---
  def update
    respond_to do |format|
      if @role.update(role_params)

DELETE FROM `roles` WHERE `roles`.`id` = 4
---
  def destroy
    @role.destroy

SELECT `roles`.* FROM `roles` WHERE `roles`.`id` = 4 LIMIT 1
---
    def set_role
      @role = Role.find(params[:id])