app/controllers/users_controller.rb

  def index
    @users = User.all
---
SELECT `users`.* FROM `users` WHERE (1=0)

  def update
    @user = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 ORDER BY `users`.`id` ASC LIMIT 1

  def destroy
    user = User.find(params[:id])
    unless user == current_user
      user.destroy
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 ORDER BY `users`.`id` ASC LIMIT 1
DELETE FROM `users` WHERE `users`.`id` = 4